%PAUSE
%Создаёт и отменяет паузу
%Во время паузы Rule не передаёт данные

global Pause;
global Rules;

%% Пересборка управляющего потока
pcode main.m;
Rules=zeros(size(Rules));
if (size(Pause)==[0,0])
    Pause=0;
end
%Смена паузы.
Pause=1-Pause

%% Посылка "Стоп" на всех роботов.
if (Pause==1)
    Rules(1,:)=[2,1,0,0,0,0,0];
    Rules(2,:)=[1,0,0,0,0,0,0];
    Rules(3,:)=[1,0,0,0,0,0,0];
    Rules(4,:)=[1,0,0,0,0,0,0];
    pause(0.1);
    Rules(1,:)=[2,1,0,0,0,0,0];
    Rules(2,:)=[1,0,0,0,0,0,0];
    Rules(3,:)=[1,0,0,0,0,0,0];
    Rules(4,:)=[1,0,0,0,0,0,0];
else
    Rules(1,:)=[2,1,0,0,0,0,0];
end

%% 